### File Read and Write Operation

1. dataset = titanic.csv

In [55]:
import pandas as np
import numpy as np
np.set_printoptions(precision=4)

In [2]:
df = pd.read_csv("titanic.csv")

In [3]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.tail(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [6]:
print(df.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [8]:
df[["Name","Sex","Age"]].head(10)

                                                Name     Sex   Age
0                            Braund, Mr. Owen Harris    male  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                             Heikkinen, Miss. Laina  female  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                           Allen, Mr. William Henry    male  35.0
5                                   Moran, Mr. James    male   NaN
6                            McCarthy, Mr. Timothy J    male  54.0
7                     Palsson, Master. Gosta Leonard    male   2.0
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0
9                Nasser, Mrs. Nicholas (Adele Achem)  female  14.0

In [9]:
df = pd.read_csv("titanic.csv", index_col=['PassengerId','Pclass','Name','Age'])
df

,,,,Survived,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,Pclass,Name,Age,,,,,,,,
1,3,"Braund, Mr. Owen Harris",22.0,0,male,1,0,A/5 21171,7.2500,NaN,S
2,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",38.0,1,female,1,0,PC 17599,71.2833,C85,C
3,3,"Heikkinen, Miss. Laina",26.0,1,female,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,female,1,0,113803,53.1000,C123,S
5,3,"Allen, Mr. William Henry",35.0,0,male,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,2,"Montvila, Rev. Juozas",27.0,0,male,0,0,211536,13.0000,NaN,S
888,1,"Graham, Miss. Margaret Edith",19.0,1,female,0,0,112053,30.0000,B42,S
889,3,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,0,female,1,2,W./C. 6607,23.4500,NaN,S
890,1,"Behr, Mr. Karl Howell",26.0,1,male,0,0,111369,30.0000,C148,C
891,3,"Dooley, Mr. Patrick",32.0,0,male,0,0,370376,7.7500,NaN,Q

In [10]:
pd.read_csv('titanic.csv', skiprows=[0,1,2])

,3,1,3.1,"Heikkinen, Miss. Laina",female,26,0,0.1,STON/O2. 3101282,7.925,Unnamed: 10,S
0,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
1,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
2,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
3,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
4,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
884,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
885,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
886,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
887,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### Reading files from url

2. dataset = Football reference scores from url

In [57]:
url = "https://www.pro-football-reference.com/boxscores/game-scores.htm"

football = pd.read_html(url)
football

[        Rk  Score  PtsW  PtsL  PtTot  PD  Count Unnamed: 7  \
 0        1  20-17    20    17     37   3    266  all games
 1        2  27-24    27    24     51   3    211  all games
 2        3  17-14    17    14     31   3    195  all games
 3        4  23-20    23    20     43   3    185  all games
 4        5  24-17    24    17     41   7    168  all games
 ...    ...    ...   ...   ...    ...  ..    ...        ...
 1049  1050   66-0    66     0     66  66      1  all games
 1050  1051  50-28    50    28     78  22      1  all games
 1051  1052  54-24    54    24     78  30      1  all games
 1052  1053  37-12    37    12     49  25      1  all games
 1053  1054  36-16    36    16     52  20      1  all games

                                               Last Game
 0     Baltimore Ravens vs. San Francisco 49ers, Dece...
 1     Miami Dolphins vs. New England Patriots, Decem...
 2     Washington Redskins vs. Seattle Seahawks, Nove...
 3     Green Bay Packers vs. Detroit Lions, December ...
 4     Oakland Raiders vs. Los Angeles Chargers, Dece...
 ...                                                 ...
 1049  Rochester Jeffersons vs. Fort Porter , October...
 1050  San Diego Chargers vs. Miami Dolphins, Septemb...
 1051  Los Angeles Chargers vs. Buffalo Bills, Novemb...
 1052  Seattle Seahawks vs. Arizona Cardinals, Septem...
 1053  Seattle Seahawks vs. Green Bay Packers, Septem...

 [1054 rows x 9 columns]]

### Kinds of dataset
3. dataset = files(csv, txt, tsv, html)

In [97]:
df1 = pd.read_csv('ex1.csv')
df1.head()

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [102]:
pd.read_table('ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [98]:
df2 = pd.read_table('test.tsv')
df2.head()

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

In [106]:
pd.read_csv('ex2.csv')

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [105]:
pd.read_csv('ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [110]:
df3 = pd.read_csv('ex2.csv', names=['abcd','efgh','b','c','message','aa'])
df3

   abcd  efgh   b   c message  aa
0     1     2   3   4   hello NaN
1     5     6   7   8   world NaN
2     9    10  11  12     foo NaN

In [111]:
df4 = pd.read_csv('csv_mindex.csv', index_col=['key1','key2'])
df4

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [120]:
pd.read_csv('ex4.csv')

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [112]:
pd.read_csv('ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [113]:
df5 = pd.read_csv('ex5.csv')
df5
pd.isnull(df5)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [114]:
df5 = pd.read_csv('ex5.csv', na_values=['NULL'])
df5

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [119]:
#writing data to text format
data = pd.read_csv('ex5.csv')
df5 = data[['a','b','c','d','message']]
df5

   a   b     c   d message
0  1   2   3.0   4     NaN
1  5   6   NaN   8   world
2  9  10  11.0  12     foo

In [115]:
df6 = pd.read_csv('ex6.csv')
df6

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [116]:
#store in json data format
df6.to_json('ex1.json')

In [117]:
pd.read_csv('ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [118]:
#chunk
chunk = pd.read_csv('ex6.csv', chunksize=1000)
chunk

In [121]:
data.to_csv('out.csv')

In [126]:
dat = pd.read_csv('out.csv')
dat

   Unnamed: 0 something  a   b     c   d message
0           0       one  1   2   3.0   4     NaN
1           1       two  5   6   NaN   8   world
2           2     three  9  10  11.0  12     foo

In [122]:
data.to_csv('out1.csv', sep='@')

In [123]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [124]:
data.to_csv('out2.csv', index=False, header=False)

In [125]:
data.to_csv('out3.csv', index=False, columns=['a','b','c'])

In [127]:
dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=dates)
ts.to_csv('tseries.csv')
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

### Working with Delimited Formats

In [129]:
import csv
f = open('ex7.csv')

reader = csv.reader(f)

reader

In [130]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [131]:
with open('ex7.csv') as f:
    lines = list(csv.reader(f))

In [132]:
lines[0]

['a', 'b', 'c']

In [133]:
lines[2]

['1', '2', '3']

In [135]:
lines[0: ]

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [136]:
lines[1: ]

[['1', '2', '3'], ['1', '2', '3']]

In [137]:
a,b,c = 1,2,'sabita'

In [138]:
header, values = lines[0], lines[1:]

In [139]:
values

[['1', '2', '3'], ['1', '2', '3']]

In [142]:
l1 = [1,2,3,4]
l2 = [5,6,7,'sabita']

In [143]:
for i in zip(l1,l2):
    print(i)

(1, 5)
(2, 6)
(3, 7)
(4, 'sabita')

In [144]:
d = {}
for i,j in zip(header, zip(*values)):
    d[i] = j
    
d

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

Dictionary Comprehensions Operation
* other way to write the same output

In [145]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [147]:
## multiple line code

"""abcd
efgh
ijkl
mnop
qrst
"""

'abcd\nefgh\nijkl\nmnop\nqrst\n'

In [140]:
dat = pd.read_csv('tseries.csv')
dat

   Unnamed: 0  0
0  2000-01-01  0
1  2000-01-02  1
2  2000-01-03  2
3  2000-01-04  3
4  2000-01-05  4
5  2000-01-06  5
6  2000-01-07  6

## 4. JSON Data

In [148]:

obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [149]:
import json
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [26]:
siblings = pd.DataFrame(result['siblings'],columns=['name','age','pets'])
siblings

    name  age                    pets
0  Scott   30            [Zeus, Zuko]
1  Katie   38  [Sixes, Stache, Cisco]

In [27]:
places = pd.DataFrame(result['places_lived'])
places

               0
0  United States
1          Spain
2        Germany

In [60]:
jdata = pd.read_json('example.json')
jdata

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [61]:
print(jdata.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [62]:
print(jdata.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

### XML and Html : Web Scraping

In [63]:
tables = pd.read_html('fdic_failed_bank_list.html')
tables

[                             Bank Name             City  ST   CERT  \
 0                          Allied Bank         Mulberry  AR     91
 1         The Woodbury Banking Company         Woodbury  GA  11297
 2               First CornerStone Bank  King of Prussia  PA  35312
 3                   Trust Company Bank          Memphis  TN   9956
 4           North Milwaukee State Bank        Milwaukee  WI  20364
 ..                                 ...              ...  ..    ...
 542                 Superior Bank, FSB         Hinsdale  IL  32646
 543                Malta National Bank            Malta  OH   6629
 544    First Alliance Bank & Trust Co.       Manchester  NH  34264
 545  National State Bank of Metropolis       Metropolis  IL   3815
 546                   Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 ..                                   ...                 ...
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

           Updated Date
 0    November 17, 2016
 1    November 17, 2016
 2    September 6, 2016
 3    September 6, 2016
 4        June 16, 2016
 ..                 ...
 542    August 19, 2014
 543  November 18, 2002
 544  February 18, 2003
 545     March 17, 2005
 546     March 17, 2005

 [547 rows x 7 columns]]

In [64]:
tables = pd.read_html('fdic_failed_bank_list.html')
len(tables)
failures = tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [151]:
failures['Closing Date']

0      September 23, 2016
1         August 19, 2016
2             May 6, 2016
3          April 29, 2016
4          March 11, 2016
              ...
542         July 27, 2001
543           May 3, 2001
544      February 2, 2001
545     December 14, 2000
546      October 13, 2000
Name: Closing Date, Length: 547, dtype: object

In [152]:
type(failures['Closing Date'][0])

str

In [153]:
failures.dtypes

Bank Name                object
City                     object
ST                       object
CERT                      int64
Acquiring Institution    object
Closing Date             object
Updated Date             object
dtype: object

In [150]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()
#close_timestamps.dt.year.value_counts()
#close_timestamps.dt.day.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

## Binary Data Formats

In [66]:
frame = pd.read_csv('ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [67]:
frame = pd.read_csv('ex1.csv')
frame
frame.to_pickle('frame_pickle')

In [68]:
pd.read_pickle('frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

## Using HDF5 Format

In [69]:
frame = pd.DataFrame({'a':np.random.randn(100)})
store = pd.HDFStore('mydata.h5')
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [70]:
store['obj1']

           a
0   1.292791
1   0.067817
2   0.045756
3  -2.082918
4   2.414961
..       ...
95 -1.588741
96 -0.963310
97  0.352205
98  1.166971
99  0.065569

[100 rows x 1 columns]

In [71]:
store.put('obj2', frame, format='table')
store.select('obj2', where=['index >= 10 and index <= 15'])
store.close()

In [72]:
frame.to_hdf('mydata.h5','obj3', format='table')
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0  1.292791
1  0.067817
2  0.045756
3 -2.082918
4  2.414961

## Web APIs

In [73]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [154]:
# not a good idea to to directly read from url
pd.read_csv('https://api.github.com/repos/pandas-dev/pandas/issues')

Empty DataFrame
Columns: [[{"url":"https://api.github.com/repos/pandas-dev/pandas/issues/36169", repository_url:"https://api.github.com/repos/pandas-dev/pandas", labels_url:"https://api.github.com/repos/pandas-dev/pandas/issues/36169/labels{/name}", comments_url:"https://api.github.com/repos/pandas-dev/pandas/issues/36169/comments", events_url:"https://api.github.com/repos/pandas-dev/pandas/issues/36169/events", html_url:"https://github.com/pandas-dev/pandas/pull/36169", id:694485212, node_id:"MDExOlB1bGxSZXF1ZXN0NDgwODU2MDA4", number:36169, title:"BUG GH31355 fixed by adding more relevant error message", user:{"login":"TAJD", id:11210290, node_id:"MDQ6VXNlcjExMjEwMjkw", avatar_url:"https://avatars0.githubusercontent.com/u/11210290?v=4", gravatar_id:"", url:"https://api.github.com/users/TAJD", html_url:"https://github.com/TAJD", followers_url:"https://api.github.com/users/TAJD/followers", following_url:"https://api.github.com/users/TAJD/following{/other_user}", gists_url:"https://api.github.com/users/TAJD/gists{/gist_id}", starred_url:"https://api.github.com/users/TAJD/starred{/owner}{/repo}", subscriptions_url:"https://api.github.com/users/TAJD/subscriptions", organizations_url:"https://api.github.com/users/TAJD/orgs", repos_url:"https://api.github.com/users/TAJD/repos", events_url:"https://api.github.com/users/TAJD/events{/privacy}", received_events_url:"https://api.github.com/users/TAJD/received_events", type:"User", site_admin:false}, labels:[], state:"open", locked:false, assignee:null, assignees:[], milestone:null, comments:1, created_at:"2020-09-06T18:47:12Z", updated_at:"2020-09-06T18:49:31Z", closed_at:null, author_association:"CONTRIBUTOR", active_lock_reason:null, pull_request:{"url":"https://api.github.com/repos/pandas-dev/pandas/pulls/36169", html_url:"https://github.com/pandas-dev/pandas/pull/36169".1, diff_url:"https://github.com/pandas-dev/pandas/pull/36169.diff", patch_url:"https://github.com/pandas-dev/pandas/pull/36169.patch"}, body:"- [x] closes #31355 \r\n- [x] tests added / passed\r\n- [x] passes `black pandas`\r\n- [x] passes `git diff upstream/master -u -- \"*.py\" | flake8 --diff`\r\n\r\nAdded a test to trigger the reported error using code from the issue. An if statement was included to return a more helpful error message - borrowing the solution from the issue. ", performed_via_github_app:null}, {"url":"https://api.github.com/repos/pandas-dev/pandas/issues/36168", repository_url:"https://api.github.com/repos/pandas-dev/pandas".1, labels_url:"https://api.github.com/repos/pandas-dev/pandas/issues/36168/labels{/name}", comments_url:"https://api.github.com/repos/pandas-dev/pandas/issues/36168/comments", events_url:"https://api.github.com/repos/pandas-dev/pandas/issues/36168/events", html_url:"https://github.com/pandas-dev/pandas/pull/36168", id:694454508, node_id:"MDExOlB1bGxSZXF1ZXN0NDgwODI5MzA4", number:36168, title:"Comma cleanup", user:{"login":"JonathanShrek", id:38149479, node_id:"MDQ6VXNlcjM4MTQ5NDc5", avatar_url:"https://avatars2.githubusercontent.com/u/38149479?v=4", gravatar_id:"".1, url:"https://api.github.com/users/JonathanShrek", html_url:"https://github.com/JonathanShrek", followers_url:"https://api.github.com/users/JonathanShrek/followers", following_url:"https://api.github.com/users/JonathanShrek/following{/other_user}", gists_url:"https://api.github.com/users/JonathanShrek/gists{/gist_id}", starred_url:"https://api.github.com/users/JonathanShrek/starred{/owner}{/repo}", subscriptions_url:"https://api.github.com/users/JonathanShrek/subscriptions", organizations_url:"https://api.github.com/users/JonathanShrek/orgs", repos_url:"https://api.github.com/users/JonathanShrek/repos", events_url:"https://api.github.com/users/JonathanShrek/events{/privacy}", received_events_url:"https://api.github.com/users/JonathanShrek/received_events", type:"User".1, site_admin:false}.1, labels:[].1, state:"open".1, locked:false.1, assignee:null.1, assignees:[].1, milestone:null.1, comments:0, created_at:"2020-09-06T17:10:01Z", updated_at:"2020-09-06T17:29:04Z", closed_at:null.1, author_association:"CONTRIBUTOR".1, active_lock_reason:null.1, pull_request:{"url":"https://api.github.com/repos/pandas-dev/pandas/pulls/36168", html_url:"https://github.com/pandas-dev/pandas/pull/36168".1, diff_url:"https://github.com/pandas-dev/pandas/pull/36168.diff", patch_url:"https://github.com/pandas-dev/pandas/pull/36168.patch"}, body:"- [x] pandas/tests/indexing/test_iloc.py\r\n- [x] pandas/tests/indexing/test_indexing.py\r\n- [x] pandas/tests/indexing/test_loc.py\r\n- [x] pandas/tests/internals/test_internals.py\r\n- [x] pandas/tests/io/formats/test_css.py\r\n- [x] pandas/tests/io/formats/test_info.py\r\n- [x] pandas/tests/io/json/test_compression.py\r\n- [x] pandas/tests/io/json/test_pandas.py\r\n- [x] pandas/tests/io/parser/test_c_parser_only.py\r\n- [x] pandas/tests/io/parser/test_parse_dates.py\r\n- [x] pandas/tests/io/parser/test_usecols.py\r\n", performed_via_github_app:null}.1, {"url":"https://api.github.com/repos/pandas-dev/pandas/issues/36165", repository_url:"https://api.github.com/repos/pandas-dev/pandas".2, labels_url:"https://api.github.com/repos/pandas-dev/pandas/issues/36165/labels{/name}", comments_url:"https://api.github.com/repos/pandas-dev/pandas/issues/36165/comments", events_url:"https://api.github.com/repos/pandas-dev/pandas/issues/36165/events", html_url:"https://github.com/pandas-dev/pandas/issues/36165", id:694400142, node_id:"MDU6SXNzdWU2OTQ0MDAxNDI=", ...]
Index: []

[0 rows x 2430 columns]

In [155]:
data = resp.json()

In [156]:
data[0]['user']['id']

45562402

In [157]:
df = pd.DataFrame(data)
df.columns

Index(['url', 'repository_url', 'labels_url', 'comments_url', 'events_url',
       'html_url', 'id', 'node_id', 'number', 'title', 'user', 'labels',
       'state', 'locked', 'assignee', 'assignees', 'milestone', 'comments',
       'created_at', 'updated_at', 'closed_at', 'author_association',
       'active_lock_reason', 'body', 'performed_via_github_app',
       'pull_request'],
      dtype='object')

In [159]:
pd.DataFrame(data).head()

,url,repository_url,labels_url,comments_url,events_url,html_url,id,node_id,number,title,...,milestone,comments,created_at,updated_at,closed_at,author_association,active_lock_reason,body,performed_via_github_app,pull_request
0,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/issues/36165,694400142,MDU6SXNzdWU2OTQ0MDAxNDI=,36165,BUG: Adding offset produces NonExistentTimeError,...,None,0,2020-09-06T14:25:34Z,2020-09-06T14:25:34Z,None,MEMBER,None,"In #36160, Travis had the following failure:\r...",None,NaN
1,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/pull/36164,694395754,MDExOlB1bGxSZXF1ZXN0NDgwNzc4NTg5,36164,TST verify groupby doesn't alter unit64s to fl...,...,None,0,2020-09-06T14:12:04Z,2020-09-06T14:12:04Z,None,CONTRIBUTOR,None,- [x] closes #30859 \r\n- [x ] tests added / p...,None,{'url': 'https://api.github.com/repos/pandas-d...
2,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/pull/36163,694373236,MDExOlB1bGxSZXF1ZXN0NDgwNzU5MDI3,36163,Backport PR #35914 on branch 1.1.x (Make Multi...,...,{'url': 'https://api.github.com/repos/pandas-d...,0,2020-09-06T13:01:29Z,2020-09-06T13:06:00Z,None,NONE,None,Backport PR #35914: Make MultiIndex.get_loc ra...,None,{'url': 'https://api.github.com/repos/pandas-d...
3,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/pull/36162,694372718,MDExOlB1bGxSZXF1ZXN0NDgwNzU4NTg4,36162,Backport PR #36054 on branch 1.1.x (BUG: Don't...,...,{'url': 'https://api.github.com/repos/pandas-d...,0,2020-09-06T12:59:34Z,2020-09-06T13:05:34Z,None,NONE,None,Backport PR #36054: BUG: Don't raise when cons...,None,{'url': 'https://api.github.com/repos/pandas-d...
4,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/pull/36161,694369857,MDExOlB1bGxSZXF1ZXN0NDgwNzU2MDg4,36161,BUG: Enable Series.equals to compare iterables...,...,None,1,2020-09-06T12:50:08Z,2020-09-06T12:56:45Z,None,CONTRIBUTOR,None,- [x] closes #35267\r\n- [ ] tests added / pas...,None,{'url': 'https://api.github.com/repos/pandas-d...

In [160]:
pd.DataFrame(data)[['user']]

                                                 user
0   {'login': 'rhshadrach', 'id': 45562402, 'node_...
1   {'login': 'TAJD', 'id': 11210290, 'node_id': '...
2   {'login': 'meeseeksmachine', 'id': 39504233, '...
3   {'login': 'meeseeksmachine', 'id': 39504233, '...
4   {'login': 'avinashpancham', 'id': 44933366, 'n...
5   {'login': 'rhshadrach', 'id': 45562402, 'node_...
6   {'login': 'attack68', 'id': 24256554, 'node_id...
7   {'login': 'dimithras', 'id': 32206956, 'node_i...
8   {'login': 'ShyamDesai', 'id': 39869108, 'node_...
9   {'login': 'jbrockmendel', 'id': 8078968, 'node...
10  {'login': 'VirosaLi', 'id': 7614606, 'node_id'...
11  {'login': 'jbrockmendel', 'id': 8078968, 'node...
12  {'login': 'jbrockmendel', 'id': 8078968, 'node...
13  {'login': 'phofl', 'id': 61934744, 'node_id': ...
14  {'login': 'dsaxton', 'id': 2658661, 'node_id':...
15  {'login': 'jbrockmendel', 'id': 8078968, 'node...
16  {'login': 'Dr-Irv', 'id': 15113894, 'node_id':...
17  {'login': 'jbrockmendel', 'id': 8078968, 'node...
18  {'login': 'rhshadrach', 'id': 45562402, 'node_...
19  {'login': 'rhshadrach', 'id': 45562402, 'node_...
20  {'login': 'TomAugspurger', 'id': 1312546, 'nod...
21  {'login': 'Dr-Irv', 'id': 15113894, 'node_id':...
22  {'login': 'simonjayhawkins', 'id': 13159005, '...
23  {'login': 'TomAugspurger', 'id': 1312546, 'nod...
24  {'login': 'hs2361', 'id': 51477130, 'node_id':...
25  {'login': 'justinessert', 'id': 24326925, 'nod...
26  {'login': 'jbrockmendel', 'id': 8078968, 'node...
27  {'login': 'TomAugspurger', 'id': 1312546, 'nod...
28  {'login': 'dzimmanck', 'id': 16160230, 'node_i...
29  {'login': 'gokceneraslan', 'id': 1140359, 'nod...

In [162]:
data = resp.json()
data[2]['user']

{'login': 'meeseeksmachine',
 'id': 39504233,
 'node_id': 'MDQ6VXNlcjM5NTA0MjMz',
 'avatar_url': 'https://avatars0.githubusercontent.com/u/39504233?v=4',
 'gravatar_id': '',
 'url': 'https://api.github.com/users/meeseeksmachine',
 'html_url': 'https://github.com/meeseeksmachine',
 'followers_url': 'https://api.github.com/users/meeseeksmachine/followers',
 'following_url': 'https://api.github.com/users/meeseeksmachine/following{/other_user}',
 'gists_url': 'https://api.github.com/users/meeseeksmachine/gists{/gist_id}',
 'starred_url': 'https://api.github.com/users/meeseeksmachine/starred{/owner}{/repo}',
 'subscriptions_url': 'https://api.github.com/users/meeseeksmachine/subscriptions',
 'organizations_url': 'https://api.github.com/users/meeseeksmachine/orgs',
 'repos_url': 'https://api.github.com/users/meeseeksmachine/repos',
 'events_url': 'https://api.github.com/users/meeseeksmachine/events{/privacy}',
 'received_events_url': 'https://api.github.com/users/meeseeksmachine/received_events',
 'type': 'User',
 'site_admin': False}

In [75]:
issues = pd.DataFrame(data,columns=['number','title','labels','state','user'])
issues.head(10)

,number,title,labels,state,user
0,36165,BUG: Adding offset produces NonExistentTimeError,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open,"{'login': 'rhshadrach', 'id': 45562402, 'node_..."
1,36164,TST verify groupby doesn't alter unit64s to fl...,[],open,"{'login': 'TAJD', 'id': 11210290, 'node_id': '..."
2,36163,Backport PR #35914 on branch 1.1.x (Make Multi...,"[{'id': 71268330, 'node_id': 'MDU6TGFiZWw3MTI2...",open,"{'login': 'meeseeksmachine', 'id': 39504233, '..."
3,36162,Backport PR #36054 on branch 1.1.x (BUG: Don't...,"[{'id': 1465286368, 'node_id': 'MDU6TGFiZWwxND...",open,"{'login': 'meeseeksmachine', 'id': 39504233, '..."
4,36161,BUG: Enable Series.equals to compare iterables...,[],open,"{'login': 'avinashpancham', 'id': 44933366, 'n..."
5,36160,CLN: _wrap_applied_output,"[{'id': 697792067, 'node_id': 'MDU6TGFiZWw2OTc...",open,"{'login': 'rhshadrach', 'id': 45562402, 'node_..."
6,36159,ENH: add set_data_classes method for CSS class...,[],open,"{'login': 'attack68', 'id': 24256554, 'node_id..."
7,36158,BUG: indices raise exception with GroupBy init...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open,"{'login': 'dimithras', 'id': 32206956, 'node_i..."
8,36157,DOC: Fix capitalization among headings in doc/...,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open,"{'login': 'ShyamDesai', 'id': 39869108, 'node_..."
9,36156,STY: De-privatize imported names,[],open,"{'login': 'jbrockmendel', 'id': 8078968, 'node..."

## Interacting with Databases

1.

In [164]:
import sqlite3

#connecting with the database.
db = sqlite3.connect("my_database4.db")
#Drop the table if it already exist using execute() method.
db.execute("drop table if exists test")
query = """CREATE TABLE test1
(a VARCHAR(20), b VARCHAR(20), c REAL, d INTEGER
);"""

con = sqlite3.connect('mydata1.sqlite')
con.execute(query)
con.commit()

In [165]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [166]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5),
 ('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [77]:
cursor.description
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

NameError: name 'cursor' is not defined

2.

In [78]:
import sqlite3
#connecting with the database
db = sqlite3.connect("my_database5.db")
#drop table if it already exist using execute() method
db.execute("drop table if exists grades1")
#create table as per requirement
db.execute("create table grades1(id int, name text, score int)")
#inserting values inside the created table
db.execute("insert into grades1(id, name, score) values(01, 'John', 99)")
db.execute("insert into grades1(id, name, score) values(02, 'Bhawana', 78)")
db.execute("insert into grades1(id, name, score) values(03, 'sabita', 97)")
db.execute("insert into grades1(id, name, score) values(04, 'puja', 80)")

In [79]:
db.commit()

In [80]:
results = db.execute("select * from grades1 order by id")
for row in results:
    print((row))
    
print("_"* 60)

(1, 'John', 99)
(2, 'Bhawana', 78)
(3, 'sabita', 97)
(4, 'puja', 80)
____________________________________________________________

In [81]:
results = db.execute("select * from grades1 where name = 'Bhawana'")
for row in results:
    print(row)

print("-" * 50)

(2, 'Bhawana', 78)
--------------------------------------------------

In [82]:
results = db.execute("select * from grades1 where score >= 90")
for row in results:
    print(row)

(1, 'John', 99)
(3, 'sabita', 97)

In [83]:
results = db.execute("select * from grades1 where score <=80")
for row in results:
    print(row)

(2, 'Bhawana', 78)
(4, 'puja', 80)

In [84]:
results = db.execute("select name, score from grades1 order by score desc ")
for row in results:
    print(row)

('John', 99)
('sabita', 97)
('puja', 80)
('Bhawana', 78)

In [85]:
results = db.execute("select name, score from grades1 order by score")
for row in results:
    print(row)

('Bhawana', 78)
('puja', 80)
('sabita', 97)
('John', 99)

In [86]:
results = db.execute("select name, score from grades1 order by name ")
for row in results:
    print(row)

('Bhawana', 78)
('John', 99)
('puja', 80)
('sabita', 97)